[
  {
    "id": 1,
    "estate_title": "Modern Family Home with Garden Oasis",
    "segment_name": "Single-family homes",
    "description": "Step into the comfort and serenity of this modern family home nestled in a quiet suburban neighborhood. This spacious residence offers ample living space spread across two levels, with large windows that fill the interiors with natural light. The open-concept living area is perfect for entertaining, while the gourmet kitchen features sleek countertops and stainless steel appliances. Upstairs, you'll find four cozy bedrooms, including a luxurious master suite with a spa-like ensuite bathroom. Step outside to discover a private garden oasis, complete with lush landscaping, a patio for outdoor dining, and a sparkling swimming pool.",
    "price": "$650,000",
    "status": "sale",
    "area": "2800 sq ft",
    "location": "Los Angeles, California",
    "facilities": ["Living Room", "Swimming Pool", "Kitchen"],
    "features": [
      "Air Conditioning",
      "Barbeque",
      "Dryer",
      "Gym",
      "Lawn",
      "Microwave",
      "Outdoor Shower",
      "Refrigerator",
      "TV Cable",
      "Washer",
      "WiFi"
    ],
    "bedroom": 4,
    "bathroom": 3,
    "image": "https://images.pexels.com/photos/2102587/pexels-photo-2102587.jpeg?auto=compress&cs=tinysrgb&w=600"
  },
  {
    "id": 2,
    "estate_title": "Charming Townhouse in Historic District",
    "segment_name": "Townhouses",
    "description": "Discover the charm of this historic townhouse located in the heart of a vibrant downtown district. This meticulously restored home features original architectural details combined with modern amenities for comfortable living. The inviting living area boasts exposed brick walls, hardwood floors, and a cozy fireplace, perfect for relaxing evenings with family and friends. The gourmet kitchen is a chef's delight, with granite countertops, stainless steel appliances, and plenty of cabinet space. Upstairs, you'll find three spacious bedrooms, each with its own unique character and style. Outside, a quaint courtyard offers a peaceful retreat from city life, ideal for enjoying your morning coffee or hosting intimate gatherings.",
    "price": "$500,000",
    "status": "sale",
    "area": "2000 sq ft",
    "location": "Boston, Massachusetts",
    "facilities": ["Living Room", "Courtyard", "Kitchen"],
    "features": [
      "Air Conditioning",
      "Barbeque",
      "Dryer",
      "Lawn",
      "Microwave",
      "Refrigerator",
      "TV Cable",
      "Washer",
      "WiFi"
    ],
    "bedroom": 3,
    "bathroom": 2,
    "image": "https://images.pexels.com/photos/3625713/pexels-photo-3625713.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2"
  },
  {
    "id": 3,
    "estate_title": "Luxury Apartment with Skyline Views",
    "segment_name": "Apartments",
    "description": "Experience luxurious city living in this stunning apartment with panoramic skyline views. Located in a prestigious high-rise building, this spacious residence offers contemporary design and upscale amenities. The expansive living area is bathed in natural light, with floor-to-ceiling windows that frame breathtaking city vistas. The sleek kitchen features designer cabinetry, quartz countertops, and top-of-the-line appliances, making it a chef's dream. Retreat to the master suite, complete with a spa-like ensuite bathroom and custom walk-in closet. Additional highlights include a private balcony, perfect for enjoying morning coffee or evening cocktails, as well as access to a fitness center, pool, and concierge services.",
    "price": "$800,000",
    "status": "sale",
    "area": "1500 sq ft",
    "location": "New York City, New York",
    "facilities": ["Living Room", "Balcony", "Kitchen"],
    "features": [
      "Air Conditioning",
      "Dryer",
      "Gym",
      "Refrigerator",
      "TV Cable",
      "Washer",
      "WiFi"
    ],
    "bedroom": 2,
    "bathroom": 2,
    "image": "https://images.pexels.com/photos/1571460/pexels-photo-1571460.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2"
  },
  {
    "id": 4,
    "estate_title": "Modern Student Housing Near Campus",
    "segment_name": "Student housing",
    "description": "Live in style and convenience in this modern student housing complex located just steps from campus. Designed with the needs of students in mind, this contemporary residence offers comfortable living spaces, study areas, and recreational amenities. Each fully furnished unit features a private bedroom, ensuite bathroom, and shared common areas, including a spacious living room and well-equipped kitchen. Enjoy access to on-site amenities such as a fitness center, study lounges, and outdoor recreational areas. With its convenient location and modern amenities, this student housing complex provides the perfect environment for academic success and socializing with fellow students.",
    "price": "$1,000 (monthly rent)",
    "status": "rent",
    "area": "400 sq ft",
    "location": "Austin, Texas",
    "facilities": ["Private Bedroom", "Ensuite Bathroom", "Common Areas"],
    "features": [
      "Air Conditioning",
      "Dryer",
      "Gym",
      "Refrigerator",
      "TV Cable",
      "Washer",
      "WiFi"
    ],
    "bedroom": 1,
    "bathroom": 1,
    "image": "https://images.pexels.com/photos/667838/pexels-photo-667838.jpeg?auto=compress&cs=tinysrgb&w=600"
  },
  {
    "id": 5,
    "estate_title": "Senior Living Community with Resort Amenities",
    "segment_name": "Senior living communities",
    "description": "Discover the perfect blend of luxury and comfort in this vibrant senior living community designed for active retirees. Situated in a picturesque setting with manicured grounds and scenic walking paths, this resort-style community offers an array of amenities and activities to suit every lifestyle. Residents can enjoy chef-prepared meals in the elegant dining room, stay active with fitness classes and wellness programs, or relax and socialize in the clubhouse or outdoor patio areas. The spacious apartments are thoughtfully designed with modern finishes and conveniences, including full kitchens, walk-in showers, and ample storage space. With 24-hour staff and a calendar full of events and outings, this senior living community provides a worry-free lifestyle for residents to enjoy their golden years to the fullest.",
    "price": "Starting at $3,000 (monthly rent)",
    "status": "rent",
    "area": "1000 sq ft",
    "location": "Scottsdale, Arizona",
    "facilities": ["Dining Room", "Fitness Center", "Outdoor Patio"],
    "features": [
      "Air Conditioning",
      "Barbeque",
      "Dryer",
      "Gym",
      "Lawn",
      "Refrigerator",
      "Swimming Pool",
      "TV Cable",
      "Washer",
      "WiFi"
    ],
    "bedroom": 1,
    "bathroom": 1,
    "image": "https://images.pexels.com/photos/3935320/pexels-photo-3935320.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2"
  },
  {
    "id": 6,
    "estate_title": "Secluded Beachfront Vacation Rental",
    "segment_name": "Vacation rentals",
    "description": "Escape to paradise in this secluded beachfront vacation rental offering unparalleled privacy and breathtaking ocean views. Nestled along the pristine shores of a secluded island, this luxurious retreat provides the ultimate beach getaway. The spacious living area features floor-to-ceiling windows that frame panoramic views of the turquoise waters, while the fully equipped kitchen is perfect for preparing gourmet meals. Relax and unwind in the plush bedrooms, each appointed with luxurious linens and comfortable furnishings. Step outside to the expansive deck, where you can soak up the sun, enjoy al fresco dining, or take a refreshing dip in the private pool. With its tranquil setting and luxurious amenities, this beachfront rental is the perfect destination for your next tropical vacation.",
    "price": "$1,200 (nightly rate)",
    "status": "rent",
    "area": "2500 sq ft",
    "location": "Maui, Hawaii",
    "facilities": ["Beach Access", "Private Pool", "Oceanfront Deck"],
    "features": [
      "Air Conditioning",
      "Barbeque",
      "Dryer",
      "Microwave",
      "Outdoor Shower",
      "Refrigerator",
      "Swimming Pool",
      "TV Cable",
      "Washer",
      "WiFi"
    ],
    "bedroom": 3,
    "bathroom": 3,
    "image": "https://images.pexels.com/photos/280229/pexels-photo-280229.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2"
  },
  {
    "id": 7,
    "estate_title": "Spacious Single-family Home with Mountain Views",
    "segment_name": "Single-family homes",
    "description": "Embrace mountain living in this spacious single-family home offering stunning views and modern comforts. Situated on a picturesque hillside, this home features expansive windows that capture the beauty of the surrounding landscape. The open-concept living area boasts vaulted ceilings, a stone fireplace, and hardwood floors, creating a warm and inviting atmosphere. The chef's kitchen is equipped with stainless steel appliances, granite countertops, and a large island, perfect for entertaining. Retreat to the master suite, complete with a luxurious ensuite bathroom and private balcony overlooking the mountains. Additional highlights include a home office, game room, and outdoor patio for enjoying the fresh mountain air.",
    "price": "$900,000",
    "status": "sale",
    "area": "3500 sq ft",
    "location": "Denver, Colorado",
    "facilities": ["Living Room", "Home Office", "Outdoor Patio"],
    "features": [
      "Air Conditioning",
      "Barbeque",
      "Dryer",
      "Gym",
      "Lawn",
      "Refrigerator",
      "Swimming Pool",
      "TV Cable",
      "Washer",
      "WiFi"
    ],
    "bedroom": 4,
    "bathroom": 3,
    "image": "https://images.pexels.com/photos/2089698/pexels-photo-2089698.jpeg?auto=compress&cs=tinysrgb&w=600"
  },
  {
    "id": 8,
    "estate_title": "Urban Loft with Industrial Chic Design",
    "segment_name": "Apartments",
    "description": "Live in style in this urban loft showcasing industrial chic design and modern amenities. Located in a converted warehouse in the trendy downtown district, this loft offers a unique living experience with exposed brick walls, concrete floors, and soaring ceilings. The open floor plan features a spacious living area, perfect for entertaining guests or relaxing at home. The sleek kitchen is equipped with stainless steel appliances, quartz countertops, and a large island with bar seating. Upstairs, the loft-style bedroom overlooks the main living space, with a walk-in closet and ensuite bathroom. Enjoy access to building amenities, including a rooftop terrace, fitness center, and resident lounge.",
    "price": "$750,000",
    "status": "sale",
    "area": "2000 sq ft",
    "location": "Portland, Oregon",
    "facilities": ["Living Room", "Rooftop Terrace", "Fitness Center"],
    "features": [
      "Air Conditioning",
      "Dryer",
      "Gym",
      "Refrigerator",
      "TV Cable",
      "Washer",
      "WiFi"
    ],
    "bedroom": 2,
    "bathroom": 2,
    "image": "https://resido-v2.smartdemowp.com/wp-content/uploads/2022/07/p-27.jpg"
  },
  {
    "id": 9,
    "estate_title": "Quaint Cottage in Picturesque Countryside",
    "segment_name": "Vacation rentals",
    "description": "Experience rustic charm and tranquility in this quaint cottage nestled in the picturesque countryside. Surrounded by rolling hills and lush greenery, this cozy retreat offers a peaceful escape from the hustle and bustle of city life. The inviting living area features exposed wooden beams, a stone fireplace, and comfortable furnishings, creating a warm and welcoming atmosphere. The well-equipped kitchen is perfect for preparing home-cooked meals, with a dining area that overlooks the scenic landscape. Upstairs, you'll find two charming bedrooms, each with its own unique character and style. Step outside to the spacious garden, where you can relax on the patio, enjoy a barbecue with friends, or explore the nearby hiking trails and natural wonders.",
    "price": "$300 (nightly rate)",
    "status": "rent",
    "area": "1200 sq ft",
    "location": "Carmel-by-the-Sea, California",
    "facilities": ["Garden", "Patio", "Scenic Views"],
    "features": [
      "Air Conditioning",
      "Barbeque",
      "Dryer",
      "Lawn",
      "Refrigerator",
      "TV Cable",
      "Washer",
      "WiFi"
    ],
    "bedroom": 2,
    "bathroom": 1,
    "image": "https://images.pexels.com/photos/262405/pexels-photo-262405.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=2"
  }
]
